Repository: worksOnMyMachine-szutowicz/LocalScoreboard
Catalog: LocalScoreboard/Resources/*.lproj/Localizable.strings
Languages: pl

# global.back
source: < Back
pl: < Wstecz

# global.quit
source: Quit
pl: Wyjdź

# global.cancel
source: Cancel
pl: Anuluj

# global.save
source: Save
pl: Zapisz

# global.fullRules
source: Full rules
pl: Pełne zasady

# global.warning
source: Warning
pl: Uwaga

# newGame.addPlayer.title
source: Players
pl: Gracze

# newGame.addPlayer.player
source: Player %@
pl: Gracz %@

# newGame.play
source: Let's Play!
pl: Zagrajmy!

# inputPopover.title
source: Add score for: %@
pl: Dodaj wynik dla: %@

# inputPopover.quickDraws
source: Quick draws
pl: Szybki wybór

# inputPopover.selection
source: Selection
pl: Wybór

# quitGame.title
source: Quit game
pl: Wyjście z gry

# quitGame.message
source: Do You really want to quit game? Current game data will be lost
pl: Na pewno chcesz wyjść? Dane obecnej gry zostaną otracone

# 1000dices.title
source: 1000 Dices
pl: 1000 Kości

# 1000dices.description
source: Roll the dices, create structures and be the first one to score 1000 points!
pl: Rzucaj kośćmi, twórz układy i bądź pierwszym graczem, który osiągnie 1000 punktów!

# 1000dices.rules.requirements.title
source: Requirements
pl: Wymagania

# 1000dices.rules.requirements.content
source: You need 5 dices, that's it! Some friend or few to roll the with You would be nice too.
pl: Potrzebujesz 5 kości, to wszystko! Jakiś znajomek albo kilku do wspólnej gierki też nie zaszkodzi.

# 1000dices.rules.objective.title
source: Objective
pl: Cel

# 1000dices.rules.objective.content
source: Be the first one to collect 1000 points.
pl: Być pierwszym, który osiągnie 1000 punktów.

# 1000dices.rules.generalRules.title
source: General rules
pl: Zasady ogólne

# 1000dices.rules.generalRules.content
source: Player's turn is to roll the dices and combine the scoring ones. When You would roll one or more scoring ones You MAY push Your luck and roll once again leaving at least one dice behind. In case when You managed to make all five dices scoring You MUST roll again with all five dices, keeping in mind already gathered score. Turn ends when player didn't roll any of scoring dices in the last roll, which leaves him with score 0 and phase-specific punishment, or when he wishes to submit his current score instead of rerolling. Current score is sum of phase-specific values of already rolled scoring dices. Game is divided into two phases described in detail below. Terminology: Rolled dice with single dot on the top -> 1. Rolled dice with two dots on the top -> 2. Rolled dice with three dots on the top -> 3. ... Rolled dice with six dots on the top -> 6.
pl: Tura gracza polega na rzucaniu kośćmi i zbieraniu tych, które punktują. Kiedy wyrzucisz jedną lub więcej punktującą kość MOŻESZ spróbować szczęścia i rzucić kośćmi jeszcze raz zostawiając przynajmniej jedną na stole. W przypadku, gdy uda Ci się wyrzucić wszystkie pięć punktujących kości MUSISZ rzucić jeszcze raz wszystkimi, zatrzymując dotychczasowy wynik w pamięci. Tura kończy się gdy gracz nie wyrzuci w ostatnim rzucie żadnej punktującej kości, co skutkuje wynikiem równym 0 oraz specyficzną dla fazy karą dla niego, lub gdy poprosi o zapisanie jego aktualnego wyniku rezygnując z prawa do dalszego rzucania kośćmi. Aktualny wynik jest sumą specyficznych dla fazy wartości już wyrzuconych, punktujących kości. Gra jest podzielna na dwie fazy opisane szczegółowo poniżej. Terminologia: Wyrzucona kość z jedną kropką na górze -> 1. Wyrzucona kość z dwoma kropkami na górze -> 2. Wyrzucona kość z trzema kropkami na górze -> 3. ... Wyrzucona kość z sześcioma kropkami na górze -> 6.

# 1000dices.rules.phaseOneRules.title
source: Phase One rules
pl: Zasady Fazy Pierwszej

# 1000dices.rules.phaseOneRules.content
source: In order to win the game player has to enter it first. In Phase One You need to score at least 50 points in single turn to start Phase Two with 0 points and finish Phase One. Any surplus over the minimum 50 will be added to the initial score. The trick is, that the only scoring dices are 1. (10 points) and 5. (5 points). However, there's no real punishment for not getting any scoring dice in each roll, beside loosing the turn ofcourse. So manage Your rerolls wisely and You will get there sooner rather than later!
pl: Żeby wygrać grę trzeba najpierw do niej wejść. W Fazie Pierwszej potrzebujesz uzyskać przynajmniej 50 punktów w turze, aby ją ukończyć i rozpoocząć Fazę Drugą z wynikiem 0 punktów. Jakakolwiek nadwyżka ponad minimalne 50 punktów będzie dopisana do wyniku w Fazie Drugiej. Cały myk polega na tym, że punktują tylko następujące kości: 1. (10 punktów) i 5. (5 punktów). W zamian za to nie ma żadnej kary za niewyrzucenie żadnej punktującej kości w ostatnim rzucie, poza, rzecz jasna, stratą kolejki. Tak więc zarządzaj swoimi rzutami mądrze i w końcu wyjdziesz, prędzej czy później się uda!

# 1000dices.rules.phaseTwoRules.title
source: Phase Two rules
pl: Zasady Fazy Drugiej

# 1000dices.rules.phaseTwoRules.content
source: In Phase two things get a little tricky. It lasts for the rest of the game, which means many points need to be collected. Luckly, beside scoring rules from Phase One, Phase Two comes with so called structures. Structures are simply three or more dices which have been rolled with the same number in SINGLE ROLL. Once rolled structure cannot be divided. Their score can be counted using following equastion: Rn * 10 * 2^Ssd where Rn stands for "Rolled number" and Ssd for "Surplus structure dices" Here are few examples: 3. 3. 3. 6. 2. -> 30 4. 4. 4. 4. 4. -> 160 1. 1. 1. 1. 3. -> 200 And adding scoring rules from Phase one: 2. 2. 2. 5. 3. -> 25 3. 3. 3. 5. 5. -> 40 6. 6. 6. 6. 1. -> 130 The goods of Phase Two has been discovered, but what would they be without a bit of bitterness? Here's the list: 1. Punishment for not rolling any scoring dice in FIRST roll of the turn is -10 points 2. After surpassing 100 points mark watchout for Your playmates! When any of them IS SURPASSING Your current score You will get burdened with -100 points. However, if they would align with Your exact score noone would get taxed. 3. There are two passages on the way to 1000 points: from 300 to 400 points and from 700 to 800 points, where boundaries are excluded. Passage means that You must not sumbit more than one score during the passage. So this basically means that You are enforced to make a one big leap instead of many little steps. 4. You must get exact 1000 points. You won't be able to submit more. Good Luck!
pl: W Fazie Drugiej sprawy stają się nieco bardziej skomplikowane. Trwa ona już do końca gry, co oznacza wiele punktów czekających na zdobycie. Na szczęście, poza zasadami punktowania z fazy pierwszej, faza druga wjeżdża, niczym husaria pod Wiedniem, z tak zwanymi układami. Układy to najprościej rzecz ujmując trzy, cztery lub pięć tych samych kości, które zostały wyrzucone w POJEDYNCZYM RZUCIE. Raz wyrzucony układ nie może być rozdzielany. Ich wynik ustalany jest z wykorzystaniem następującego wzoru: Rn * 10 * 2^Ssd gdzie Rn oznacza "Wyrzucony numer", a Ssd "Nadwyżke kości tworzących układ" Kilka przykładów: 3. 3. 3. 6. 2. -> 30 4. 4. 4. 4. 4. -> 160 1. 1. 1. 1. 3. -> 200 I jeszcze kilka uwzględniając zasady punktowania z fazy pierwszej: 2. 2. 2. 5. 3. -> 25 3. 3. 3. 5. 5. -> 40 6. 6. 6. 6. 1. -> 130 Dobre wieści dotyczące fazy drugiej zostały wyjaśnione, lecz czym byłaby beczka miodu bez łyżki dziegciu? Oto lista: 1. Kara za niewyrzucenie żadnej punktującej kości w PIERWSZYM rzucie kolejki to -10 punktów. 2. Po przekroczeniu 100 punktów uważaj na pozostałych graczy! Kiedy którykolwiek z nich WYPRZEDZI Cię na liście wyników zostaniesz obciążony -100 punktami. Jednakże, jeśli ten ktoś zrówna się idealnie z Twoim wynikiem to nikt nie zostanie poszkodowany. 3. Na drodzę do 1000 punktów znajdują się dwa przejścia: z 300 na 400 punktów oraz z 700 na 800 punktów, wyłączając wartości graniczne. Przejście oznacza, że nie możesz zapisać wyniku w danym przedziale więcej niż raz. Oznacza to, że jesteś zmuszony do wyrzucenia dużej liczby punktów zamiast trzymać się taktyki małych kroków przez całą grę. 4. Musisz uzbierać dokładnie 1000 punktów. Nie będziesz w stanie zapisać choćby punktu ponad to. Powodzenia!

# 1000dices.input.error.phaseOne
source: You need to score at least %@ points to get into the game! See Rules -> Phase One rules for more info
pl: Musisz uzyskać przynajmniej %@ punktów aby wejść do gry! Sprawdź Zasady -> Zasady Fazy Pierwszej po więcej informacji

# 1000dices.input.error.passage
source: You are on passage! See Rules -> Phase Two rules -> Point 3. for more info
pl: Jesteś na przejściu! Sprawdź Zasady -> Zasady Fazy Drugiej -> Punkt 3. po więcej informacji

# 1000dices.input.error.surplus
source: You can't exceed 1000 points! See Rules -> Phase Two rules -> Point 4. for more info
pl: Nie możesz przekroczyć 1000 punktów! Sprawdź Zasady -> Zasady Fazy Drugiej -> Punkt 4. po więcej informacji

# 1000dices.input.warning.passage
source: You are about to submit %@ points which will place You in the lower half of the passage. It means that You'll need to score at least %@ points in next turn. Are You sure?
pl: Próbujesz dodać %@ punktów co umiejscowi Cię w dolnej połowie przejścia. Oznacza to, że będziesz potrzebować przynajmniej %@ punktów w następnej kolejce. Dodajemy?

# 1000dices.finishGame.title
source: %@ has won!
pl: Gracz %@ zwyciężył!

# 1000dices.finishGame.message
source: How about another round with the same players?
pl: Jeszcze jedna rundka z tymi samymi graczami?
